<a href="https://colab.research.google.com/github/abnv16/learn_py/blob/main/TASK_16.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Given index=["India","Pakistan","Bangladesh","Srilanka","china","Nepal"] and data=[1,3,5,np.nan,6,8] . Create a table with the "index" as indices and data as values.

      Expected output

        India         1.0
        Pakistan      3.0
        Bangladesh    5.0
        Srilanka      NaN
        China         6.0
        Nepal         8.0
        Name: myseries, dtype: float64

In [1]:
import numpy as np
import pandas as pd
index=["India","Pakistan","Bangladesh","Srilanka","china","Nepal"]
data=[1,3,5,np.nan,6,8]
print(pd.Series(data,index, name='myseries'))

India         1.0
Pakistan      3.0
Bangladesh    5.0
Srilanka      NaN
china         6.0
Nepal         8.0
Name: myseries, dtype: float64

2. Create a data 'dates' starting from 2021-01-01 with range 6. and create a random 6x4 array and a list=('ABCD').now create a dataframe with 'dates' as index and list as the column and data as the datas of this table.


  Expected output

                        A	       B	      C	      D
    2021-01-01	-0.429358	0.779826	0.389625	0.248792
    2021-01-02	-1.044721	0.272807	-0.370437	1.177273
    2021-01-03	-0.961394	-0.525376	0.120843	0.470060
    2021-01-04	1.842266	-0.551049	0.588390	-0.326937
    2021-01-05	0.986198	0.391301	-0.084837	-0.855573
    2021-01-06	-1.531207	0.905463	-0.099024	0.589219

In [2]:
import numpy as np
import pandas as pd
dates = pd.date_range('2021-01-01',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2021-01-01 -1.769962 -0.156304  0.155304 -0.313704
2021-01-02  1.864176  0.750502  0.617547 -0.003126
2021-01-03  0.539845  0.314440  0.009833  0.177920
2021-01-04  1.224442  0.101729 -0.369847  2.005651
2021-01-05  0.744340  1.410646 -0.713898 -1.697354
2021-01-06 -0.718635 -1.257092  0.886848  1.411444